Revit 2027 API
CylindricalFace.Origin Property
Origin of the surface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ Origin { get; }
Public ReadOnly Property Origin As XYZ
	Get
public:
property XYZ^ Origin {
	XYZ^ get ();
}
member Origin : XYZ with get
Property Value
XYZ
See Also
Reference
CylindricalFace Class
Autodesk.Revit.DB Namespace